{
  "nav": {
    "about": "About",
    "work": "Work",
    "contact": "Contact"
  },
  "intro": {
    "greeting": "Hi, I'm",
    "name": "Sara Latrache",
    "subtitle": "I'm a Full Stack Developer",
    "description": "passionate about crafting clean, efficient, and impactful digital experiences"
  },
  "about": {
    "introduction": "Introduction",
    "overview": "Overview.",
    "description": "I am a Full Stack Developer with over 3 years of experience building high-performance, scalable web applications. I specialize in JavaScript and Golang, with strong expertise in both front-end and back-end development using technologies such as React, Node.js, Express, and modern Go frameworks.\n\nI have a proven track record of delivering efficient solutions that improve performance and user engagement, including reducing load times, optimizing backend architectures, and developing robust REST and GraphQL APIs. I'm experienced in managing projects from concept to production, collaborating with teams and clients to translate business needs into reliable, user-friendly applications.\n\nPassionate about clean architecture, performance optimization, and continuous learning, I also enjoy sharing knowledge through mentoring and JavaScript training."
  },
  "experience": {
    "title": "Work Experience.",
    "subtitle": "What I have done so far",
    "exis": {
      "title": "Full Stack Developer",
      "company_name": "Exis Engineering Solutions Srl",
      "date": "March 2025 - Present",
      "points": [
        "Developed and maintained a traffic analytics dashboard for traffic planning, simulation, and optimization (Pianificazione e simulazione di reti di traffico).",
        "Implemented data analytics pipelines for traffic flow analysis using interactive maps, charts, and real-time visualizations.",
        "Built advanced geospatial and 3D visualizations leveraging Deck.gl, Leaflet, and .PLY 3D models to represent traffic networks and simulation results.",
        "Designed and enhanced data visualization components to highlight key traffic indicators and decision-support insights.",
        "Developed backend services using Python and Flask to process, analyze, and expose traffic data via REST APIs.",
        "Collaborated closely with engineering teams to translate traffic modeling requirements into scalable software solutions.",
        "Handled application deployment and environment configuration, ensuring performance, reliability, and maintainability of production systems."
      ]
    },
    "cookiejar": {
      "title": "Full Stack Developer | Project Manager",
      "company_name": "Cookie Jar Tech",
      "date": "September 2022 - October 2024",
      "points": [
        "Developed and contributed to large-scale, multi-platform e-commerce systems supporting high-traffic online stores.",
        "Maintained, refactored, and enhanced legacy projects by applying clean code principles, design patterns, and industry best practices.",
        "Significantly reduced the number of production bugs by identifying root causes and delivering fixes within tight and respectful deadlines, earning the internal nickname \"Sara the Bug Slayer\" from the CTO.",
        "Designed and developed a Human Resources (HR) management platform including employee leave (leaves management) and absence tracking workflows.",
        "Collaborated closely with product owners, CTO, and cross-functional teams to improve system reliability, scalability, and long-term maintainability.",
        "Improved overall application performance and stability, accelerating feature delivery and reducing maintenance overhead."
      ]
    },
    "sastecskills": {
      "title": "JavaScript Instructor (Part-time)",
      "company_name": "SastecSkills",
      "date": "June 2022 - October 2022",
      "points": [
        "Delivered JavaScript and MERN Stack bootcamps.",
        "Supervised students on frontend and backend projects.",
        "Conducted workshops on task management and problem-solving in professional environments."
      ]
    },
    "sastec": {
      "title": "Backend Developer (Golang)",
      "company_name": "SASTEC Group",
      "date": "October 2021 - September 2022",
      "points": [
        "Developed REST and GraphQL APIs using Golang.",
        "Maintained and improved existing backend systems.",
        "Integrated SaaS services, video processing, and live webinar platforms.",
        "Worked within SCRUM methodology in a collaborative team."
      ]
    }
  },
  "projects": {
    "title": "Projects.",
    "subtitle": "My work",
    "description": "The following projects highlight my professional experience as a Full Stack and Backend Developer, working on real-world applications in production. They demonstrate my ability to design scalable architectures, build REST and GraphQL APIs, optimize performance, and collaborate within Agile teams, while showcasing hands-on experience with modern JavaScript frameworks, Golang services, databases, and cloud solutions. Personal projects include full technical details, features, and source code when available. For company projects, I provide clear descriptions of functionality, my role, and contributions. Due to confidentiality agreements, source code and live demos for company projects are not shared.",
    "readMore": "Read more",
    "readLess": "Read less",
    "school-management": {
      "name": "School Management System",
      "company": "Personal",
      "description": "Designed and developed a comprehensive web and mobile-based school management platform that covers the entire academic workflow. The system manages academic years and trimesters, student enrollment, teachers, parents, subjects, and class assignments. Advanced features include timetable generation and management, subject-to-teacher assignment, attendance tracking, grades and exam management, and payment and fee handling. A dedicated mobile application for parents allows real-time access to their children's attendance, grades, timetables, exam schedules, and academic progress. The platform is built with a strong focus on role-based access control, data accuracy, scalability, and usability for administrators, teachers, students, and parents."
    },
    "products-management": {
      "name": "Products Management System",
      "company": "Cookie Jar Tech",
      "description": "Designed and developed a complete product and inventory management system tailored for warehouse and retail businesses. The platform handles end-to-end product lifecycle management, automated order processing, multi-warehouse stock and quantity tracking, and advanced reporting. Implemented PDF generation for invoices and reports, along with multi-channel product export and synchronization with external e-commerce platforms such as WooCommerce, PrestaShop, and Shopify using multiple data formats (XML, JSON, etc.). Focused on scalability, performance optimization, and seamless integration with third-party services."
    },
    "traffic-dashboard": {
      "name": "Traffic Dashboard Monitoring",
      "company": "Exis Engineering Solutions Srl",
      "description": "Developed and maintained an advanced traffic analytics and monitoring dashboard aimed at traffic planning, simulation, and optimization (Pianificazione e simulazione di reti di traffico). Built data analytics pipelines to process and analyze traffic flow data, presenting insights through interactive maps, dynamic charts, and near real-time visualizations. Implemented complex geospatial and 3D visualizations using Deck.gl, Leaflet, and .PLY 3D models to accurately represent traffic networks and simulation outputs. Collaborated closely with traffic engineers and domain experts to translate complex modeling requirements into scalable and maintainable software solutions. Also managed deployment, environment configuration, and performance tuning to ensure high reliability and responsiveness."
    },
    "video-solution": {
      "name": "Professional Video Solution for Businesses",
      "company": "Sastech Group",
      "description": "Contributed to the development and long-term maintenance of a professional video platform designed for enterprise use. The solution includes multiple modules such as advanced analytics, public and private APIs, video editing tools, TV portals, live broadcasting, and pay-per-view services. The platform supports a wide range of business use cases including marketing campaigns, internal HR communication, corporate messaging, and employee training. Focused on building scalable backend services, ensuring high availability for live streaming, and delivering a seamless user experience across web and TV platforms."
    }
  },
  "testimonials": {
    "title": "Testimonials.",
    "subtitle": "What others say",
    "readMore": "Read more",
    "showLess": "Show less"
  },
  "contact": {
    "title": "Contact.",
    "subtitle": "Get in touch",
    "nameLabel": "Your Name",
    "emailLabel": "Your email",
    "messageLabel": "Your Message",
    "namePlaceholder": "What's your good name?",
    "emailPlaceholder": "What's your web address?",
    "messagePlaceholder": "What you want to say?",
    "send": "Send",
    "sending": "Sending...",
    "successMessage": "Thank you. I will get back to you as soon as possible.",
    "errorMessage": "Ahh, something went wrong. Please try again."
  },
  "loading": {
    "loading": "Loading..."
  },
  "error": {
    "title": "Oops! Something went wrong",
    "description": "We're sorry for the inconvenience. Please try refreshing the page.",
    "refresh": "Refresh Page"
  }
}
